app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."host_id" = $1  [["host_id", 11]]
---
		<div class ='row px-2 justify-content-around'>
			<% @user.hosted_events.each do |hosted_event| %>